[
	{
		"title": "TNTP Our Block",
		"tools": [
			{ "icon": "react", "link": "https://react.dev/learn" },
			{ "icon": "auth0", "link": "https://auth0.com/docs" },
			{ "icon": "sanity", "link": "https://www.sanity.io/docs?ref=navbar" },
			{ "icon": "i18next", "link": "https://react.i18next.com/" },
			{ "icon": "mapbox", "link": "https://docs.mapbox.com/" },
			{ "icon": "material-ui", "link": "https://mui.com/material-ui/" }
		],
		"image": "/images/tntp.png",
		"vimeoID": "1098353784",
		"notes": [
			"This project was an overhaul of an existing prototype built in React and required the addition of Auth0 for user management and authentication. I had to learn how to fire event hooks from Auth0 to keep our user profile data in sync with our Sanity instance.",
			"The original prototype was using Airtable for a backend which isn't scalable in terms of network calls, so I switched it to Sanity for a more robust solution and a client-friendly interface.",
			"Since the site was already established in terms of styling, I made use the existing Material UI components to scale the design system of the site."
		],
		"link": "https://ourblock.tntp.org/"
	},
	{
		"title": "Asia Society Global Public Opinion on China",
		"tools": [
			{ "icon": "svelte", "link": "https://svelte.dev/docs" },
			{ "icon": "d3", "link": "https://d3js.org/getting-started" },
			{ "icon": "drupal", "link": "https://www.drupal.org/docs/8" },
			{ "icon": "aws", "link": "https://aws.amazon.com/documentation/" },
			{
				"icon": "google-sheets",
				"link": "https://www.google.com/sheets/about/"
			}
		],
		"image": "/images/aspi.png",
		"vimeoID": "1098353328",
		"notes": [
			"For this project, the client wanted us to build a custom visualization, and then incoporate it into their existing Drupal site. I chose Svelte for the build because it is a lightweight framework that would have minimal build size.",
			"We also used Google Sheets as a backend, with an AWS Lambda function to pull the data from the sheet and write out a JSON file in a S3 bucket that the Svelte app could read.",
			"The coolest part of this build was using D3's force simulation to create geometric representations of the world's GDP and population over time and how opinions have changed on China over the last 25 years."
		],
		"link": "https://asiasociety.org/policy-institute/global-public-opinion-china"
	},
	{
		"title": "Schema Design Website",
		"tools": [
			{
				"icon": "nuxt",
				"link": "https://nuxt.com/docs/getting-started/introduction"
			},
			{ "icon": "sanity", "link": "https://www.sanity.io/docs?ref=navbar" },
			{ "icon": "netlify", "link": "https://docs.netlify.com/" }
		],
		"image": "/images/schema.png",
		"vimeoID": "1098353541",
		"link": "https://www.schemadesign.com",
		"notes": [
			"When my CEO asked me to build a new website for our company, I was excited to take on the challenge and honored to be trusted with it.",
			"I wanted to make the site as lean as possible to avoid unnecessary code bloat and dependencies, so I built all the UI components from scratch, with accessibility and performance in mind.",
			"I also wanted to make the site as fast as possible, so I used Nuxt 3's static site generation feature to pre-render all the pages and improve SEO.",
			"To streamline deployment, we use Netlify as our hosting provider. Integrating our repo with Netlify allows us to automatically and easily deploy the site whenever content updates are needed."
		]
	},
	{
		"title": "Atlantic Council Mythical Beasts",
		"tools": [
			{
				"icon": "react",
				"link": "https://nuxt.com/docs/getting-started/introduction"
			},
			{ "icon": "d3", "link": "https://d3js.org/getting-started" },
			{ "icon": "aws", "link": "https://aws.amazon.com/documentation/" }
		],
		"image": "/images/ac-mythicalbeasts.png",
		"vimeoID": "1098355972",
		"notes": [
			"For this application, the client wanted to highlight the everchanging relations of spyware companies and how they are connected to governments and other entities.",
			"The build utilizies D3's force simulation to create a network graph that shows the relationships between the entities.",
			"I also built in a playback feature that allows users to see how the relationships have changed over time.",
			"The site is built in React and Typescript, with a simple Google sheet backend that is client friendly and easy to update via an AWS Lambda function."
		],
		"link": "https://mythicalbeasts.dfrlab.org/"
	},
	{
		"title": "Sedus Workscape of Tomorrow",
		"tools": [
			{
				"icon": "nuxt",
				"link": "https://nuxt.com/docs/getting-started/introduction"
			},
			{ "icon": "sanity", "link": "https://www.sanity.io/docs?ref=navbar" },
			{ "icon": "d3", "link": "https://d3js.org/getting-started" },
			{ "icon": "firebase", "link": "https://firebase.google.com/docs" }
		],
		"image": "/images/sedus.png",
		"vimeoID": "1098353659",
		"notes": [
			"This was my first project with Nuxt 3. It was a complete rebuild of a prototype built in Vue 2 so there was quite a challenge in terms of rethinking the architecture.",
			"The project called for site translation, which required setting up localization not only in the frontend, but also in our Sanity instance for images and videos.",
			"Ultimately, the static site generation of NUXT 3 was a great fit for this project as it allowed us to create a fast and SEO-friendly site that could be easily deployed to Firebase."
		],
		"link": "https://www.workscapeoftomorrow.com"
	},
	{
		"title": "PEFA Global Report 2022",
		"tools": [
			{ "icon": "react", "link": "https://react.dev/learn" },
			{ "icon": "gatsby", "link": "https://www.gatsbyjs.com/docs/" },
			{ "icon": "i18next", "link": "https://react.i18next.com/" },
			{ "icon": "d3", "link": "https://d3js.org/getting-started" }
		],
		"image": "/images/pefa.png",
		"vimeoID": "1098353404",
		"notes": [
			"The project was an update to an on-going report we helped build for the World Bank.",
			"The site uses multiple charts built in D3, and I had to build two new one for this release.",
			"The site relies on Gatsby's static site generation to improve performance and SEO, as well as i18next for localization."
		],
		"link": "https://www.pefa.org/global-report-2022/en/"
	}
]
